src/Documents/КвитанцияМЭДО/КвитанцияМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КвитанцияМЭДО</name>
  <registerRecords>InformationRegister.СостоянияДокументовМЭДО</registerRecords>
  <attributes>
    <name>ДанныеКонверта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОшибки</name>
    <comment>Для входящих</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Для исходящей</comment>
    <type>
      <types>DefinedType.КонтрагентМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлена</name>
    <comment>Для исходящей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметКвитанцииМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеПринято</name>
    <comment>Для входящих</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/КвитанцияМЭДО/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанаКвитанцияМЭДО", Объект.Ссылка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДанныеКонвертаНажатие(Элемент)
	ТекстовыйДокумент = ТекстовыйДокументСДаннымиКонверта(Объект.Ссылка);
	ТекстовыйДокумент.Показать("envelope.ini");
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСообщенияНажатие(Элемент)
	ТекстовыйДокумент = ТекстовыйДокументСДаннымиСообщения(Объект.Ссылка);
	ТекстовыйДокумент.Показать(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПринятоПриИзменении(Элемент)
	ВидимостьРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТекстовыйДокументСДаннымиСообщения(Квитанция)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	Хранилище = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Квитанция, "ДанныеСообщения");
	Если Хранилище = Неопределено Тогда
		Возврат ТекстовыйДокумент;
	КонецЕсли;
	
	ДвоичныеДанные = Хранилище.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат ТекстовыйДокумент;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ТекстовыйДокумент.Прочитать(ИмяВременногоФайла, "UTF-8");
	УдалитьФайлы(ИмяВременногоФайла);
	Возврат ТекстовыйДокумент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстовыйДокументСДаннымиКонверта(Квитанция)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	Хранилище = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Квитанция, "ДанныеКонверта");
	Если Хранилище = Неопределено Тогда
		Возврат ТекстовыйДокумент;
	КонецЕсли;
	
	ДвоичныеДанные = Хранилище.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат ТекстовыйДокумент;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("ini");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ТекстовыйДокумент.Прочитать(ИмяВременногоФайла, "windows-1251");
	УдалитьФайлы(ИмяВременногоФайла);
	Возврат ТекстовыйДокумент;
	
КонецФункции

&НаКлиенте
Процедура ВидимостьРеквизитов()
	
	Элементы.КодОшибки.Видимость			= Не Объект.СообщениеПринято;
	Элементы.КомментарийОшибки.Видимость	= Не Объект.СообщениеПринято;
	
КонецПроцедуры

#КонецОбласти
